;; -*- no-byte-compile: t; -*-
;;; ~/dotfiles/doom.d/packages.el

(package! rebecca-theme)
(package! academic-phrases)
(package! banner-comment)
(package! dired-hacks)
(package! yasnippet-snippets)
(package! eterm-256color)
(package! golden-ratio)
(package! zoom)
(package! sudo-edit)
(package! keyword-search)
;; (package! transpose-frame)
;; (package! org-projectile)

(package! ado-mode
  :recipe (:host github :repo "louabill/ado-mode"))
